app/controllers/backlogs_controller.rb

SELECT "categoria".* FROM "categoria"
SELECT "sistemas".* FROM "sistemas"
SELECT "statuses".* FROM "statuses"
---
  def index
	@categoria = Categoria.all
	@sistema = Sistema.all
	@status = Status.all