app/controllers/categorias_controller.rb

INSERT INTO "categoria" ("ativo", "created_at", "descricao", "updated_at") VALUES (?, ?, ?, ?)  [["ativo", "t"], ["created_at", "2014-11-13 19:39:45.897883"], ["descricao", "Sistema"], ["updated_at", "2014-11-13 19:39:45.897883"]]
---
  def create
		#cria variavel usuario
		@categoria = Categoria.new categoria_params

		#verifica se ha erro no objeto
		if !@categoria.valid?
			redirect_to new_categoria_path, :flash => { :error => "Ocorreu um erro!", :messages =>  @categoria.errors.full_messages }
		else
			@categoria.save

SELECT "categoria".* FROM "categoria"
---
  def getfilter
		#Efetua a leitura de todos os sistemas
		@categoria = Categoria.all