app/controllers/registrations_controller.rb

INSERT INTO "users" ("ativo", "created_at", "email", "nomeCompleto", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ativo", "t"], ["created_at", "2014-10-29 20:32:46.913220"], ["email", "fajosi@gmail.com"], ["nomeCompleto", "Fabio Silva"], ["senha", "testeste"], ["updated_at", "2014-10-29 20:32:46.913220"]]
---
	def create
		#cria variavel usuario
		user = User.new user_params

		#valida preenchimento do usuario
		if user.valid?
			#render :json => user
			user.save