app/controllers/sessions_controller.rb

	def create
		#procura o usuario pela senha
		user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jaoo' LIMIT 1