app/controllers/sistemas_controller.rb

	def index
		#Efetua a leitura de todos os sistemas
		@sistemas = Sistema.all
---
SELECT  "sistemas".* FROM "sistemas"   ORDER BY "sistemas"."id" ASC LIMIT 1

	def create
		#cria variavel usuario
		sistema = Sistema.new sistema_params

		#verifica se ha erro no objeto
		if !sistema.valid?
			redirect_to new_sistema_path, :flash => { :error => "Ocorreu um erro!", :messages =>  sistema.errors.full_messages }
		else
			sistema.save
---
INSERT INTO "sistemas" ("ativo", "codigo", "created_at", "nomeabreviado", "nomecompleto", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def getAll
		@sistemas = Sistema.all
---
SELECT  "sistemas".* FROM "sistemas"   ORDER BY "sistemas"."id" ASC LIMIT 1