app/controllers/status_controller.rb

SELECT "categoria".* FROM "categoria"
---
  def new
	#Efetua a leitura de todos os sistemas
	@categorias = Categoria.all

SELECT "statuses".* FROM "statuses"
---
  def getfilter
		#Efetua a leitura de todos os sistemas
		@status = Status.all